zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  return true;
}

bool ClassicBtControllerTransport::waitForInputReportDrain(uint32_t timeoutMs, bool logFailure) {
  if (!paired_) {
    return true;
  }

  const uint32_t startedAt = millis();
  while (inputReportSendEventCount_ < inputReportSubmitCount_) {
    if (millis() - startedAt >= timeoutMs) {
      if (logFailure) {
        Serial.printf(
            "WARN bt send_report drain timeout waited_ms=%lu submitted=%lu completed=%lu\n",
            static_cast<unsigned long>(timeoutMs),
            static_cast<unsigned long>(inputReportSubmitCount_),
            static_cast<unsigned long>(inputReportSendEventCount_));
      }
      return false;
    }
    delay(1);
  }

  return true;
}

bool ClassicBtControllerTransport::beginExplicitInput() {
  explicitInputActive_ = true;

  if (inputReportSendMutex_ == nullptr) {
    return true;
  }

  if (inputReportSendMutex_ == nullptr) {
    return true;
  }

  xSemaphoreTakeRecursive(inputReportSendMutex_, portMAX_DELAY);

  // Wait for in-flight idle-send BTA callbacks to drain BEFORE resetting the
  // submit/event counters. The idle task may have already posted send_report
  // API calls (mutex given, BTA message queued) whose SEND_REPORT_EVT has not
  // fired yet. If we reset immediately, those pending EVTs will later advance
  // inputReportSendEventCount_ into the range we reserved for explicit sends,
  // causing waitForInputReportAccepted to exit prematurely using the IDLE
  // send's status — making all retries in repeatCurrentInputReport look like
  // they fail even though L2CAP may have cleared congestion.
  if (paired_ && inputReportSendEventCount_ < inputReportSubmitCount_) {
    const uint32_t drainStart = millis();
    while (inputReportSendEventCount_ < inputReportSubmitCount_ &&
           (millis() - drainStart) < 100) {
      delay(1);
    }
    Serial.printf(
        "INFO bt send_report drain submitted=%lu completed=%lu elapsed=%lu\n",
        static_cast<unsigned long>(inputReportSubmitCount_),
        static_cast<unsigned long>(inputReportSendEventCount_),
        static_cast<unsigned long>(millis() - drainStart));
    // Align to actual event count regardless of timeout.
    inputReportSubmitCount_ = inputReportSendEventCount_;
  }
  return true;
}

void ClassicBtControllerTransport::endExplicitInput() {
  if (inputReportSendMutex_ != nullptr) {
    xSemaphoreGiveRecursive(inputReportSendMutex_);
  }
  explicitInputActive_ = false;
}

bool ClassicBtControllerTransport::repeatCurrentInputReport(
    uint16_t durationMs, bool logFailure) {
  const uint32_t startedAt = millis();
  uint32_t congestionStartedAt = 0;
  bool loggedCongestionRetry = false;

  while (true) {
    // Fire-and-forget (waitForSendEvent=false): esp_bt_hid_device_send_report
    // returns ESP_OK when L2CAP accepts the packet into xmit_hold_q even when
    // the channel is congested (L2CAP_DW_CONGESTED). The packet IS queued and
    // WILL be delivered as the ACL link drains. Waiting for the EVT and
    // treating reason=8 as failure causes spurious retries that fill the queue
    // further and block the main loop for hundreds of ms.
    if (!sendCurrentInputReport(logFailure, false)) {
      if (shouldRetryAfterTransientSendFailure()) {
        if (congestionStartedAt == 0) {
          congestionStartedAt = millis();
        }

        if (!loggedCongestionRetry && logFailure) {
          loggedCongestionRetry = true;
          Serial.printf(
              "WARN bt send_report congested retry_window=%u\n",
              kHidCongestionRetryBudgetMs);
        }

        if ((millis() - congestionStartedAt) < kHidCongestionRetryBudgetMs) {
          delay(kHidCongestionRetryDelayMs);
          continue;
        }
      }

      return false;
    }

    congestionStartedAt = 0;
    loggedCongestionRetry = false;

    const uint32_t elapsed = millis() - startedAt;
    if (elapsed >= durationMs) {
      break;
    }

    const uint32_t remaining = durationMs - elapsed;
    delay(remaining < HID_REPEAT_INTERVAL_MS ? remaining : HID_REPEAT_INTERVAL_MS);
  }

  return true;
}

void ClassicBtControllerTransport::resetInputReportTracking() {
  inputReportSubmitCount_ = 0;
  inputReportSendEventCount_ = 0;
  lastInputReportStatus_ = -1;
  lastInputReportReason_ = 0;
  reportCongested_ = false;
  consecutiveSendReportFailures_ = 0;
}

void ClassicBtControllerTransport::markControllerPaired() {
  if (!paired_) {
    resetInputReportTracking();
  }
  paired_ = true;
  pairingComplete_ = true;
}

bool ClassicBtControllerTransport::sendSubcommandReply(
    uint8_t reportId, const uint8_t *data, size_t length, const char *label) {
  readyForReports_ = isHidReportChannelOpen();

  if (!readyForReports_) {
    Serial.printf("WARN bt reply skipped reason=not-ready label=%s\n", label);
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      reportId,
      length,
      const_cast<uint8_t *>(data));
  if (err != ESP_OK) {
    sendReportFailureCount_ += 1;
    lastSendReportStatus_ = static_cast<int>(err);
    lastSendReportReason_ = 0;
    lastSendReportId_ = reportId;
    readyForReports_ = isHidReportChannelOpen();
    Serial.printf(
        "WARN bt reply failed label=%s err=%s fail_count=%lu\n",
        label,
        esp_err_to_name(err),
        static_cast<unsigned long>(sendReportFailureCount_));
    return false;
  }

  Serial.printf("INFO bt reply label=%s report=%u len=%u\n", label, reportId, length);
  return true;
}

bool ClassicBtControllerTransport::attemptVirtualCablePlug(
    const uint8_t peerAddress[6], const char *reason) {
  if (!appRegistered_ || !hidReady_ || connected_) {
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_connect(const_cast<uint8_t *>(peerAddress));
  if (err != ESP_OK) {
    Serial.printf(
        "WARN bt virtual-cable reason=%s err=%s peer=%s\n",
        reason,
        esp_err_to_name(err),
        formatBluetoothAddress(peerAddress).c_str());
    return false;
  }

  Serial.printf(
      "INFO bt virtual-cable reason=%s peer=%s\n",
      reason,
      formatBluetoothAddress(peerAddress).c_str());
  return true;
}

void ClassicBtControllerTransport::processIncomingReport(uint8_t reportId, uint16_t len, uint8_t *data) {
  if (len < 12 || data == nullptr) {
    const bool repeated = ignoredReportCount_ > 0 && lastIgnoredReportId_ == reportId &&
                          lastIgnoredReportLen_ == len;
    ignoredReportCount_ += 1;
    lastIgnoredReportId_ = reportId;
    lastIgnoredReportLen_ = len;
    if (!repeated || ignoredReportCount_ <= 5 || (ignoredReportCount_ % 20) == 0) {
      Serial.printf(
          "INFO bt intr ignored report=%u len=%u count=%lu\n",
          reportId,
          len,
          static_cast<unsigned long>(ignoredReportCount_));
    }
    return;
  }

  Serial.printf(
      "INFO bt intr report=%u len=%u subcmd=%u arg0=%u arg1=%u\n",
      reportId,
      len,
      data[9],
      data[10],
      data[11]);

  if (data[9] == 2) {
    // Subcmd 0x02: Request Device Info.
    sendSubcommandReply(0x21, kReply02, sizeof(kReply02), "reply02");
    return;
  }
  if (data[9] == 8) {
    sendSubcommandReply(0x21, kReply08, sizeof(kReply08), "reply08");
    return;
  }
  if (data[9] == 16 && data[10] == 0 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress0, sizeof(kReplySpiAddress0), "replyspi0");
    return;
  }
  if (data[9] == 16 && data[10] == 80 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress50, sizeof(kReplySpiAddress50), "replyspi50");
    return;
  }
  if (data[9] == 3) {
    // Explicitly acknowledge the transition to Report Mode 0x30
    sendSubcommandReply(0x21, kReply03, sizeof(kReply03), "reply03");
    markControllerPaired(); // Ensure the send task knows we are live
    return;
  }
  if (data[9] == 4) {
    sendSubcommandReply(0x21, kReply04, sizeof(kReply04), "reply04");
    return;
  }
  if (data[9] == 16 && data[10] == 128 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress80, sizeof(kReplySpiAddress80), "replyspi80");
    return;
  }
  if (data[9] == 16 && data[10] == 152 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress98, sizeof(kReplySpiAddress98), "replyspi98");
    return;
  }
  if (data[9] == 16 && data[10] == 16 && data[11] == 128) {
    sendSubcommandReply(0x21, kReplySpiAddress10, sizeof(kReplySpiAddress10), "replyspi10");
    return;
  }
  if (data[9] == 16 && data[10] == 61 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress3D, sizeof(kReplySpiAddress3D), "replyspi3d");
    return;
  }
  if (data[9] == 16 && data[10] == 32 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress20, sizeof(kReplySpiAddress20), "replyspi20");
    return;
  }
  if (data[9] == 64) {
    sendSubcommandReply(0x21, kReply4001, sizeof(kReply4001), "reply4001");
    return;
  }
  if (data[9] == 72) {
    sendSubcommandReply(0x21, kReply4801, sizeof(kReply4801), "reply4801");
    return;
  }
  if (data[9] == 34) {
    sendSubcommandReply(0x21, kReply3401, sizeof(kReply3401), "reply3401");
    return;
  }
  if (data[9] == 48) {
    markControllerPaired();
    sendSubcommandReply(0x21, kReply3001, sizeof(kReply3001), "reply3001");
    return;
  }
  if (data[9] == 33 && data[10] == 33) {
    markControllerPaired();
    sendSubcommandReply(0x21, kReply3333, sizeof(kReply3333), "reply3333");
    return;
  }
}

void ClassicBtControllerTransport::handleGapEvent(int event, void *rawParam) {
  const auto gapEvent = static_cast<esp_bt_gap_cb_event_t>(event);
  auto *param = reinterpret_cast<esp_bt_gap_cb_param_t *>(rawParam);

